[CW_Pistol_AF2011Ex]
ItemName="AF2011 Ex"
ItemCategory="Hand Gun"
ItemDescription="*Control power removed: knockdown/stumble/gun hit set lower\n*Reload speed: 20% faster while rounds remain, vanilla speed on empty\n*Recoil: stronger vertical kick, steadier side pull\n*Gunslinger Rack 'em Up: paired headshots count as 2 stacks, including when the first impact kills a Trash Zed\n*RPM: 316 RPM\n*Penetration: 1.5"

[CW_Pistol_DualAF2011Ex]
ItemName="Dual AF2011 Ex"
ItemCategory="Hand Gun"
ItemDescription="*Control power removed: knockdown/stumble/gun hit set lower\n*Reload speed: 20% faster while rounds remain, vanilla speed on empty\n*Recoil: stronger vertical kick, steadier side pull\n*Gunslinger Rack 'em Up: paired headshots count as 2 stacks, including when the first impact kills a Trash Zed\n*RPM: 462 RPM\n*Penetration: 1.5"

[CW_Rifle_CenterfireMB464Ex]
ItemName="Centerfire MB464 Ex"
ItemCategory="Rifle"
ItemDescription="*Damage: 165 -> 180\n*Sharpshooter/Gunslinger reload: 20% faster when perk reload skill is inactive\n*Recoil: slightly stronger vertical kick\n*Draw and put-away are faster\n*RPM: 150 RPM\n*Penetration: 1.5"

[CW_Rifle_CenterfireMB464Meme]
ItemName="Chole's SPX centerfire"
ItemCategory="Rifle"
ItemDescription="*Damage: 165 -> 220\n*Sharpshooter reload: 50% faster when Tactical Reload is inactive\n*Gunslinger reload: 60% faster\n*Empty-magazine reload: additional 8.25% faster\n*Recoil: slightly stronger vertical kick\n*Draw and put-away are faster\n*RPM: 150 RPM\n*Penetration: 1.5"

[CW_Pistol_Colt1911Ex]
ItemName="M1911 Ex"
ItemCategory="Hand Gun"
ItemDescription="*Recoil: matches vanilla\n*RPM: 343 RPM\n*Penetration: 1"

[CW_Pistol_DualColt1911Ex]
ItemName="Dual M1911 Ex"
ItemCategory="Hand Gun"
ItemDescription="*Recoil: matches vanilla\n*RPM: 600 RPM\n*Penetration: 1"

[CW_Pistol_DeagleEx]
ItemName="Deagle Ex"
ItemCategory="Hand Gun"
ItemDescription="*Tactical reload: 20% faster while rounds remain\n*Recoil: matches vanilla\n*RPM: 300 RPM\n*Penetration: 2"

[CW_Pistol_DualDeagleEx]
ItemName="Dual Deagle Ex"
ItemCategory="Hand Gun"
ItemDescription="*Tactical reload: 20% faster while rounds remain\n*RPM: 545 RPM\n*Recoil: matches vanilla\n*Penetration: 2"

[CW_AssaultRifle_FNFalCM_2xEx]
ItemName="FN FAL (2x Scope)"
ItemCategory="Assault Rifle"
ItemDescription="*Damage: 70 -> 60\n*Scope: 4x -> 2x\n*Fire rate: 606 -> 700 RPM\n*Spare ammo: 160 -> 280\n*Reload speed: 5% faster\n*Recoil: steadier\n*RPM: 700 RPM\n*Penetration: 0"

[CW_AssaultRifle_FNFal_4xEx]
ItemName="FN FAL (4x Scope)"
ItemCategory="Assault Rifle"
ItemDescription="*Damage: 70 -> 75\n*Fire rate: 606 -> 496 RPM\n*Recoil: heavier and pulls right\n*Reload speed: 5% faster\n*RPM: 496 RPM\n*Penetration: 2"

[CW_AssaultRifle_FNFal_4xMeme]
ItemName="diamondhead's FN FAL"
ItemCategory="Assault Rifle"
ItemDescription="*Damage: 70 -> 91\n*Fire rate: 606 -> 496 RPM\n*Recoil: no side pull\n*Reload speed: 25% faster for Sharpshooter when Tactical Reload is inactive\n*Empty-magazine reload: additional 8.25% faster\n*Weight: 8 -> 9\n*RPM: 496 RPM\n*Penetration: 2"

[CW_Bow_HRGCrossbowEx]
ItemName="HRG Crossbow Ex"
ItemCategory="Bow"
ItemDescription="*Medic crossbow with 27 HP heal darts\n*Ammo: 34 -> 14\n*Weight: 7 -> 6\n*Recoil: stronger than standard crossbows\n*Medic dart targeting uses the HRG Incision component\n*RPM: N/A (single-bolt cycle is animation-limited)\n*Penetration: Default 4 / Alt 3"

[CW_Rifle_M14EBREx]
ItemName="M14EBR (ACOG)"
ItemCategory="Sniper Rifle"
ItemDescription="*Damage: 80 -> 90\n*Recoil: slightly stronger vertical kick\n*RPM: 273 RPM\n*Penetration: 2"

[CW_Rifle_M14EBR_RS]
ItemName="Chloe's M14 MBR"
ItemCategory="Sniper Rifle"
ItemDescription="*Damage: 80 -> 116\n*Recoil: slightly stronger vertical kick\n*Sharpshooter reload: 35% faster when Tactical Reload is inactive\n*RPM: 273 RPM\n*Penetration: 2"

[CW_Rifle_M14EBR_IS_Ex]
ItemName="M14EBR No Scope"
ItemCategory="Sniper Rifle"
ItemDescription="*Damage: 80 -> 90\n*Recoil: heavier when aiming down sights\n*RPM: 273 RPM\n*Penetration: 2"

[CW_Rifle_MosinNagantEx]
ItemName="MosinNagant Ex"
ItemCategory="Rifle"
ItemDescription="*Damage: 250 -> 350\n*Sharpshooter reload: 25% faster when Tactical Reload is inactive\n*Spare ammo: 60 -> 70\n*Price: 700 -> 2500\n*RPM: 71 RPM\n*Penetration: 3"

[CW_Pistol_DualG18Ex]
ItemName="Dual Glock 18C Ex"
ItemCategory="Sub Machine Gun"

ItemDescription="*Damage: 40 per bullet at 1200 RPM, penetration 0\n*Reload speed: 20% faster while rounds remain, 10% faster on empty\n*Control power: stumble 12, no knockdown, no stun\n*Recoil: horizontal kick reduced 60%, vertical unchanged\n*Spread: 0.03\n*Weight: 6, 66-round mag\n*RPM: 1200 RPM\n*Penetration: 0"

[CW_Pistol_G18CEx]
ItemName="Glock 18C Ex"
ItemCategory="Sub Machine Gun"

ItemDescription="*Damage: 40 at 800 RPM auto / 343 RPM single, penetration 0\n*Reload speed: 20% faster while rounds remain, 10% faster on empty\n*Control power: stumble 12, no knockdown, no stun\n*Recoil: horizontal kick reduced 60%, vertical unchanged\n*Spread: 0.03 auto / 0.0125 single\n*Weight: 3, 33-round mag\n*RPM: Default 800 / Alt 343 RPM\n*Penetration: 0"

[CW_AssaultRifle_SCAREx]
ItemName="SCAR Ex"
ItemCategory="Assault Rifle"
ItemDescription="*Fire rate: 600 -> 625 RPM in both fire modes\n*Recoil: slightly stronger vertical kick\n*RPM: 625 RPM\n*Penetration: 0"

[CW_AssaultRifle_SCAREx_Meme]
ItemName="SCAR NonoN"
ItemCategory="Assault Rifle"
ItemDescription="*Damage: 55 -> 80\n*Fire rate: 625 -> 650 RPM\n*Magazine/spare ammo: 20/340 -> 30/570\n*Reload speed: 15% faster while rounds remain, 10% faster on empty\n*Price: 1500 -> 16000\n*RPM: 650 RPM\n*Penetration: 0"

[CW_Revolver_SW500Ex]
ItemName="Magnum Ex"
ItemCategory="Hand Gun"
ItemDescription="*Damage: 160 -> 180\n*Stumble power: 60 -> 40\n*Recoil: stronger vertical kick\n*RPM: 250 RPM\n*Penetration: 3"

[CW_Revolver_DualSW500Ex]
ItemName="Dual Magnum Ex"
ItemCategory="Hand Gun"
ItemDescription="*Damage: 160 -> 180\n*Stumble power: 60 -> 40\n*Reload speed: 45% faster\n*Recoil: stronger vertical kick\n*RPM: 316 RPM\n*Penetration: 3"
[CW_AssaultRifle_AK12_Ex]
ItemName="AK-12 Ex"
ItemCategory="Assault Rifle"
ItemDescription="*Damage: 40 -> 46\n*Weight: 6 -> 7\n*Recoil: steadier burst control\n*RPM: Default 600 / Alt 1000 RPM\n*Penetration: 0"

[CW_AssaultRifle_Bullpup_Ex]
ItemName="SA80 L85A2 Bullpup Ex"
ItemCategory="Assault Rifle"
ItemDescription="*Damage: 32 -> 33\n*Recoil: slightly steadier\n*RPM: Default 660 / Alt 600 RPM\n*Penetration: 0"

[CW_AssaultRifle_MedicRifleGrenadeLauncher_Ex]
ItemName="HMTech-501 Grenade Rifle Ex"
ItemCategory="Assault Rifle"
ItemDescription="*Full-auto primary fire\n*Alt-fire launches medic grenades\n*Primary damage: 47\n*Medic grenade impact damage: 50\n*Medic grenade gas damage: 20\n*Large-Zed rage disabled"

[CW_AssaultRifle_Medic_Ex]
ItemName="Medic Rifle Ex"
ItemCategory="Assault Rifle"
ItemDescription="*Recoil: slightly stronger vertical kick\n*Command: togglelockon toggles medic dart lock-on\n*RPM: Default 750 / Alt 343 RPM\n*Penetration: 0"

[CW_Rifle_Hemogoblin_Ex]
ItemName="Hemoclogger Ex"
ItemCategory="Rifle"
ItemDescription="*Damage: 120 -> 100\n*Magazine/spare ammo: 7/112 -> 6/56\n*Heal amount: 25 -> 20\n*DoT changed from bleeding to toxic\n*Recoil: heavier than standard medic rifles\n*Slows movement by 20% without attack-speed slow\n*Command: togglelockon toggles dart lock-on\n*RPM: Default 240 / Alt 343 RPM\n*Penetration: 0"

[CW_SMG_Medic_Ex]
ItemName="Medic SMG Ex"
ItemCategory="Sub Machine Gun"

ItemDescription="*Medic dart lock-on can be toggled with togglelockon\n*RPM: Default 800 / Alt 343 RPM\n*Penetration: 0"

[CW_SMG_Medic2_Ex]
ItemName="Medic SMG Ex"
ItemCategory="Sub Machine Gun"
ItemDescription="*Heal amount: 15 -> 10\n*Dart cost: 40 -> 25\n*Alt-fire shoots 2 darts\n*Secondary-slot medic SMG\n*Command: togglelockon toggles medic dart lock-on\n*RPM: Default 800 / Alt 444 RPM\n*Penetration: 0"

[CW_Pistol_Colt1911Ex_AT]
ItemName="M1911 AT"
ItemCategory="Hand Gun"
ItemDescription="*Recoil: matches vanilla\n*Right-click toggles full-auto mode\n*RPM: 343 RPM\n*Penetration: Default 1 / Alt 0"

[CW_Pistol_DeagleEx_AT]
ItemName="Deagle AT"
ItemCategory="Hand Gun"
ItemDescription="*Tactical reload: 20% faster while rounds remain\n*Recoil: matches vanilla\n*Right-click toggles full-auto mode\n*RPM: 300 RPM\n*Penetration: 2"

[CW_Pistol_DualColt1911Ex_AT]
ItemName="Dual M1911 AT"
ItemCategory="Hand Gun"
ItemDescription="*Recoil: matches vanilla\n*Right-click toggles full-auto mode\n*RPM: Default 600 / Alt 500 RPM\n*Penetration: 1"

[CW_Pistol_DualDeagleEx_AT]
ItemName="Dual Deagle AT"
ItemCategory="Hand Gun"
ItemDescription="*Tactical reload: 20% faster while rounds remain\n*Recoil: matches vanilla\n*Right-click toggles full-auto mode\n*RPM: 500 RPM\n*Penetration: 2"

[CW_Shotgun_AA12Ex]
ItemName="AA-12 Ex"
ItemCategory="Shotgun"
ItemDescription="*Damage: 168 total per shot (+20%)\n*RPM: 300 RPM\n*Penetration: 2\n*Reload: 15% faster; 30% faster while rounds remain"

[CW_Shotgun_DoubleBarrelEx]
ItemName="Double-Barreled Boomstick Ex"
ItemCategory="Shotgun"
ItemDescription="*Damage: 275 single / 550 double total per shot (+10%)\n*RPM: 240 RPM\n*Penetration: 2\n*Reload: 25% faster; 45% faster while rounds remain"

[CW_Shotgun_ElephantGunEx]
ItemName="Elephant Gun Ex"
ItemCategory="Shotgun"
ItemDescription="*Damage: 264 total per shot (+10%)\n*RPM: 240 RPM\n*Penetration: 4\n*Reload: 25% faster; 45% faster while rounds remain"

[CW_Shotgun_HZ12Ex]
ItemName="HZ12 Multi-Action Ex"
ItemCategory="Shotgun"
ItemDescription="*Damage: 240 total per shot (+20%)\n*RPM: 600 RPM\n*Penetration: 2\n*Reload: 15% faster; 30% faster while rounds remain"

[CW_Shotgun_M4Ex]
ItemName="M4 Combat Shotgun Ex"
ItemCategory="Shotgun"
ItemDescription="*Damage: 276 total per shot (+15%)\n*RPM: 267 RPM\n*Penetration: 2\n*Reload: 15% faster"

[CW_Shotgun_S12Ex]
ItemName="S12 Shockgun Ex"
ItemCategory="Shotgun"
ItemDescription="*Damage: 235.2 total per shot (+20%)\n*Alt-fire explosion damage: 240 (+20%)\n*RPM: Default 300 / Alt 240 RPM\n*Penetration: Default 2 / Alt 0\n*Reload: 15% faster; 30% faster while rounds remain"

[CW_SMG_KrissEx]
ItemName="Kriss Ex"
ItemCategory="Sub Machine Gun"
ItemDescription="*Damage: 36.3 per bullet (+10%)\n*RPM: 1200 RPM\n*Penetration: 0"

[CW_SMG_MP7Ex]
ItemName="MP7 Ex"
ItemCategory="Sub Machine Gun"
ItemDescription="*Damage: 21.6 per bullet (+35%)\n*RPM: 952 RPM\n*Penetration: 0"

[CW_SMG_P90Ex]
ItemName="P90 Ex"
ItemCategory="Sub Machine Gun"
ItemDescription="*Damage: 36.0 per bullet (+20%)\n*RPM: Default 857 / Alt 600 RPM\n*Penetration: 0"

[CW_Pistol_AF2011Ex_AT]
ItemName="AF2011 Ex AT"
ItemCategory="Hand Gun"
ItemDescription="*Control power removed: knockdown/stumble/gun hit set lower\n*Reload speed: 20% faster while rounds remain, vanilla speed on empty\n*Recoil: stronger vertical kick, steadier side pull\n*Right-click toggles full-auto mode\n*Gunslinger Rack 'em Up: paired headshots count as 2 stacks, including when the first impact kills a Trash Zed\n*RPM: 316 RPM\n*Penetration: 1.5"

[CW_Pistol_DualAF2011Ex_AT]
ItemName="Dual AF2011 AT"
ItemCategory="Hand Gun"
ItemDescription="*Control power removed: knockdown/stumble/gun hit set lower\n*Reload speed: 20% faster while rounds remain, vanilla speed on empty\n*Recoil: stronger vertical kick, steadier side pull\n*Right-click toggles full-auto mode\n*Gunslinger Rack 'em Up: paired headshots count as 2 stacks, including when the first impact kills a Trash Zed\n*RPM: 462 RPM\n*Penetration: 1.5"

[CW_Revolver_SW500Ex_AT]
ItemName="Magnum AT"
ItemCategory="Hand Gun"
ItemDescription="*Damage: 160 -> 180\n*Stumble power: 60 -> 40\n*Recoil: stronger vertical kick\n*Right-click toggles full-auto mode\n*RPM: 250 RPM\n*Penetration: 3"

[CW_Revolver_DualSW500Ex_AT]
ItemName="Dual Magnum AT"
ItemCategory="Hand Gun"
ItemDescription="*Damage: 160 -> 180\n*Stumble power: 60 -> 40\n*Reload speed: 45% faster\n*Recoil: stronger vertical kick\n*Right-click toggles full-auto mode\n*RPM: 316 RPM\n*Penetration: 3"

[CW_LMG_MG3Ex]
ItemName="MG3 Ex"
ItemCategory="Light Machine Gun"
ItemDescription="*Damage: 35 -> 50\n*Reload speed: 20% faster\n*RPM: Default 909 / Alt 455 RPM\n*Penetration: 0"

[CW_Bow_CrossbowEx]
ItemName="Crossbow Ex"
ItemCategory="Bow"
ItemDescription="*Reload speed: 10% faster\n*RPM: 200 RPM\n*Penetration: 4"

[CW_Bow_CompoundBowEx]
ItemName="Compound Bow Ex"
ItemCategory="Bow"
ItemDescription="*Damage: 250 -> 300\n*Reload speed: 10% faster\n*RPM: 300 RPM\n*Penetration: Default 5 / Alt 0"

[CW_Pistol_JCEx]
ItemName="Casull"
ItemCategory="Hand Cannon"

ItemDescription="*Damage: 113, penetration 2\n*Fire rate: 300 RPM\n*Recoil: moderate and controlled for its power\n*Weight: 4, 8-round mag\n*Heavy bash damage: 300\n*RPM: 300 RPM\n*Penetration: 2"

[CW_Pistol_DualJCEx]
ItemName="Jackal & Casull"
ItemCategory="Hand Gun"

ItemDescription="*Damage: 156 per bullet\n*DPM: 85,091 at 545.45 RPM, penetration 2\n*Dual fire rate: 545.45 RPM\n*Recoil: moderate dual-pistol kick\n*Weight: 8, 16-round mag\n*Heavy bash damage: 300\n*RPM: 545.45 RPM\n*Penetration: 2"

[CW_Pistol_AutoMag_Ex]
ItemName="AutoMag Ex"
ItemCategory="Hand Gun"

ItemDescription="*Damage: 127 at 300 RPM, penetration 2\n*Control power: no knockdown/stumble, gun hit 150\n*Recoil: stronger than Deagle, below SW500\n*Weight: 4, 9-round mag\n*RPM: 300 RPM\n*Penetration: 2"

[CW_Rifle_M107_Ex]
ItemName="M107 Ex"
ItemCategory="Sniper Rifle"

ItemDescription="*Damage: 300 at 200 RPM, penetration 8\n*Control power: stumble 0, no knockdown, gun hit 300\n*Recoil: near M99, but slightly softer\n*Weight: 10, 10-round mag\n*RPM: 200 RPM\n*Penetration: 8"

[CW_Rifle_M110_Ex]
ItemName="M110 SASS Ex"
ItemCategory="Sniper Rifle"

ItemDescription="*Damage: 138 at 300 RPM, penetration 2\n*Control power: stumble 20, no knockdown, stun 30\n*Recoil: heavier than M14, controlled for rapid fire\n*Weight: 8, 30-round mag\n*RPM: 300 RPM\n*Penetration: 2"

[CW_Rifle_M24_Ex]
ItemName="M24 Ex"
ItemCategory="Sniper Rifle"

ItemDescription="*Damage: 400 at 70 RPM, penetration 2\n*Control power: stumble 0, no knockdown, no stun\n*Recoil: heavy bolt-action kick, below M107\n*Weight: 8, 8-round mag\n*Reload speed: 15% faster\n*RPM: 70 RPM\n*Penetration: 2"

[CW_Pistol_DualAutoMag_Ex]
ItemName="Dual AutoMag Ex"
ItemCategory="Hand Gun"

ItemDescription="*Damage: 167 per bullet\n*DPM: 75,150 at 450 RPM, penetration 2\n*Control power: no knockdown/stumble, gun hit 150\n*Recoil: stronger than Dual Deagle, below Dual SW500\n*Weight: 8, 18-round mag\n*RPM: 450 RPM\n*Penetration: 2"

[CW_Healer_SyringeArmor]
ItemName="Syringe Armor"
ItemCategory="Off-Perk"
ItemDescription="*Heals armor instead of health, 50 armor per dose\n*Ammo: 3 doses (no refill from perk), recharge 5s per dose from reserve stock only"

[CW_Pistol_DeagleEx_Meme]
ItemName="Evil Deagle"
ItemCategory="Hand Gun"
ItemDescription="*Damage: 115 per bullet\n*Magazine: 12 rounds\n*Reserve ammo: 132 rounds\n*RPM: 350 RPM\n*Penetration: 2"

[CW_Pistol_DualDeagleEx_Meme]
ItemName="Dual Evil's Deagle"
ItemCategory="Hand Gun"
ItemDescription="*Damage: 115 per bullet\n*Magazine: 24 rounds\n*Reserve ammo: 264 rounds\n*RPM: 650 RPM\n*Penetration: 2"

[CW_Pistol_DualAF2011ExEU]
ItemName="Dual AF2011 Ex EU"
ItemCategory="Hand Gun"
ItemDescription="*Control power removed: knockdown/stumble/gun hit set lower\n*Reload speed: 20% faster while rounds remain, 35% slower on empty\n*AF2011 EU reload modifier: additional 5% slowdown on both conditions\n*Recoil: vertical min/max 650/650; horizontal min/max -225/225\n*Gunslinger Rack 'em Up: paired headshots count as 2 stacks, including when the first impact kills a Trash Zed\n*RPM: 462 RPM\n*Penetration: 1.5"

[CW_Pistol_DualDeagleExEU]
ItemName="Dual Deagle Ex EU"
ItemCategory="Hand Gun"
ItemDescription="*Reload speed: 20% faster while rounds remain, 20% slower on empty\n*Recoil: vertical min/max 650/650; horizontal inherited from vanilla\n*RPM: 500 RPM\n*Penetration: 2"

[CW_Pistol_AF2011ExEU]
ItemName="AF2011 Ex EU"
ItemCategory="Hand Gun"
ItemDescription="*Control power removed: knockdown/stumble/gun hit set lower\n*Reload speed: 20% faster while rounds remain, 35% slower on empty\n*AF2011 EU reload modifier: additional 5% slowdown on both conditions\n*Recoil: vertical min/max 650/650; horizontal min/max -225/225\n*Gunslinger Rack 'em Up: paired headshots count as 2 stacks, including when the first impact kills a Trash Zed\n*RPM: 316 RPM\n*Penetration: 1.5"

[CW_Pistol_DeagleExEU]
ItemName="Deagle Ex EU"
ItemCategory="Hand Gun"
ItemDescription="*Reload speed: 20% faster while rounds remain, 20% slower on empty\n*Recoil: vertical min/max 650/650; horizontal inherited from vanilla\n*RPM: 300 RPM\n*Penetration: 2"